maya-taylor/Project2ELEC291/integrated_files/STM32integration.c
// robot code - using new position mapping to characters

#include "../Common/Include/stm32l051xx.h"
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <string.h>
#include "../Common/Include/serial.h"
#include "UART2.h"

#define F_CPU 32000000L
#define DEF_F 10000L // a 100us tick
#define SYSCLK 32000000L

#define PI 3.141592654
#define FORWARD_ACCELERATION    77.355 // calculated via solving x = a * t^2
#define FORWARD_VELOCITY 		15.0  // cm/s -- measured value for x = 0, y = 50
#define ANGULAR_ACCELERATION    77.355 // calculated via solving theta = a * t^2, a is our anglular acceleration
#define CW_VELOCITY      		108.0 // angular velocity in degrees/s CW -- measured for forward (this value is good)
#define CCW_VELOCITY     		110.0 // angular velocity in degrees/s CCW -- measured for forward (not measured yet)
#define DIAG_VELOCITY_LEFT		35.0 // diagonal velocity for forward left
#define DIAG_VELOCITY_RIGHT		34.0 // diagonal velocity for forward right
#define F_CPU 32000000L
#define AVG_NUM 5

#define S_MANUAL 				1 
#define S_SQUARE 				2
#define S_FIGURE8 				3
#define S_PATH   				4

#define metalLevel_1   			300
#define metalLevel_2   			400
#define metalLevel_3   			500
#define metalLevel_4   			600
#define metalLevel_5   			800

// Global variables	
volatile int PWM_Counter = 0;
volatile unsigned char pwm1 = 0, pwm2 = 0;

// Global timer variables
volatile int timerCount_100us = 0;
volatile int timerCount_ms = 0;
volatile int PathFind_Flag = 0;
volatile int e_stopped = 0;
// volatile int timerCount_s = 0;

void Delay_us(unsigned char us)
{
	// For SysTick info check the STM32L0xxx Cortex-M0 programming manual page 85.
	SysTick->LOAD = (F_CPU/(1000000L/us)) - 1;  // set reload register, counter rolls over from zero, hence -1
	SysTick->VAL = 0; // load the SysTick counter
	SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk; // Enable SysTick IRQ and SysTick Timer 
	while((SysTick->CTRL & BIT16)==0); // Bit 16 is the COUNTFLAG.  True when counter rolls over from zero.
	SysTick->CTRL = 0x00; // Disable Systick counter
}

void waitms (unsigned int ms)
{
	unsigned int j;
	unsigned char k;
	for(j=0; j<ms; j++)
		for (k=0; k<4; k++) Delay_us(250);
}

void emergency_stop () {
	printf("E-stop :(\r\n");
	char buff[5];
	waitms(1000);
	PathFind_Flag = 0;
	GPIOA->ODR |= BIT7;
	
	pwm1 = 0;
	pwm2 = 0;
	GPIOA->ODR &= ~BIT2; // pin is GND
	GPIOA->ODR &= ~BIT4; // pin is GND
	while(1){
		if (ReceivedBytes2()>0)
		{
			
			egets2(buff, sizeof(buff)-1);
			//printf("%s", buff);
			if (buff[0]=='?')
			{	
				GPIOA->ODR &= ~BIT7; 
				printf("Restart :)\r\n");
				eputs2("<<\r\n");
				waitms(3);
				eputs2("<<\r\n");
				waitms(500);
				return;
			}
		}
		waitms(5);
	}
}

void stopMotors (void) {
	pwm1 = 0;
	pwm2 = 0;
	GPIOA->ODR &= ~BIT2; // pin is GND
	GPIOA->ODR &= ~BIT4; // pin is GND
}
// This process is blocking
void stopCar_ms (int milliSeconds) {

	timerCount_ms = 0;
	// then turn off motors
	while (timerCount_ms < (milliSeconds)) {
		stopMotors();
	}
}

// return 1 if new char is ? -- execute eStop
int check_estop() {
	char buff[4];

	if (ReceivedBytes2()>0) {
		egets2(buff, sizeof(buff)-1);
		return (buff[0] == '?'); // no need for an if statement since it's a boolean 
	}			
}

// this process is blocking
void forward (int cm) {
	timerCount_ms=0;
	//char buff[4];
	
	// motors go forward at max speed
	int milliSeconds = cm / FORWARD_VELOCITY*1000.0; // calculation assuming instant acceleration and const. velocity
	// 
	// new calcuation for time would take into account acceleration up to a max velocity
	while (timerCount_ms < milliSeconds) {
		if (check_estop()) {
			e_stopped = 1;
			emergency_stop();
			break; // break will exit the loop and forward() terminates
		}
		pwm1 = 4; // right motor (slower is faster)
		pwm2 = 0; // left motor  (slower is faster)
		GPIOA->ODR |= BIT2; // pin is GND
		GPIOA->ODR |= BIT4; // pin is GND
	}

	stopMotors();
}

// this process is blocking
void CW_turn(int degrees) {
	timerCount_ms=0;
	//int milliseconds = 0;

	// // old calculation
	int milliseconds = degrees/CW_VELOCITY*1000.0;

	// new calculation
	// checking if degrees is less than 90, this corresponds to the amount of time
	// it takes for the car to get up to 118 degrees / sec (max angular velocity)
	// if (degrees < 90) {
	// 	milliseconds = sqrt(2*degrees/ANGULAR_ACCELERATION) * 1000;
	// }
	// else {
	// 	int timeToMaxSpeed = sqrt(2*90/ANGULAR_ACCELERATION);
	// 	milliseconds = (timeToMaxSpeed + (degrees-90)/CW_VELOCITY)*1000;
	// }

	while (timerCount_ms < milliseconds) {
		if (check_estop()) {
			e_stopped = 1;
			emergency_stop();
			break;
		}
		pwm2 = 20; 			 	// left forward (lower is faster)
		GPIOA->ODR |= BIT4;  	// pin is at 5V
		pwm1 = 80; 		 		// right backwards
		GPIOA->ODR &= ~BIT2; 	// pin is GND
	}
	stopMotors();
}

// this process is blocking
void CCW_turn (int degrees) {
	timerCount_ms = 0;
	//int milliseconds;
	
	int milliseconds = degrees/CCW_VELOCITY*1000.0;

	// new calculation
	// if (degrees < 90) {
	// 	milliseconds = sqrt(2*degrees/ANGULAR_ACCELERATION) * 1000;
	// }
	// else {
	// 	int timeToMaxSpeed = sqrt(2*90/ANGULAR_ACCELERATION);
	// 	milliseconds = (timeToMaxSpeed + (degrees-90)/CW_VELOCITY)*1000;
	// }
	
	while (timerCount_ms < milliseconds) {
		if (check_estop()) {
			e_stopped = 1;
			emergency_stop();
			break;
		}
		pwm2 = 80; 				// left forward (lower is faster)
		GPIOA->ODR &= ~BIT4; 	// pin is at 5V
		pwm1 = 20; 				// right backwards
		GPIOA->ODR |= BIT2; 	// pin is GND
	}
	stopMotors();
}

void diag_left (int degrees) {
	timerCount_ms = 0;

	int milliseconds = degrees/DIAG_VELOCITY_LEFT*1000.0;
	while (timerCount_ms < milliseconds) {
		if (check_estop()) {
			e_stopped = 1;
			emergency_stop();
			break;
		}
		pwm2 = 40; 			 	// left forward slow
		GPIOA->ODR |= BIT4;  	// pin is at 5V
		pwm1 = 0; 		 		// right forward fast
		GPIOA->ODR |= BIT2; 	// pin is 5V
	}
	stopMotors();
}

void diag_right (int degrees) {
	timerCount_ms = 0;

	int milliseconds = degrees/DIAG_VELOCITY_RIGHT*1000.0;
	while (timerCount_ms < milliseconds) {
		if (check_estop()) {
			e_stopped = 1;
			emergency_stop();
			break;
		}
		pwm2 = 0; 			 	// left forward fast
		GPIOA->ODR |= BIT4;  	// pin is at 5V
		pwm1 = 40; 		 		// right forward slow
		GPIOA->ODR |= BIT2; 	// pin is 5V
	}
	stopMotors();
}

void circle () {
	diag_left(390); // i know this doesn't make sense but the circle is more than 360 degrees
}

