maya-taylor/Project2ELEC291/integrated_files/STM32integration.c
// drive in square - blocking!!
void square () { 
	for (int i = 0; i < 4; i++) {
		forward(20);
		stopCar_ms(10); 
		if (e_stopped) {
			e_stopped = 0;
			break;
		}

		CW_turn(88);
		stopCar_ms(10); 
		if (e_stopped) {
			e_stopped = 0;
			break;
		}
	}
}

// Drives in a figrue 8 path
void figure8(void) {
	diag_left(285);
	if (e_stopped) {
		e_stopped = 0;
		return;
	}
	forward(20);
	if (e_stopped) {
		e_stopped = 0;
		return;
	}
	diag_right(285);
	if (e_stopped) {
		e_stopped = 0;
		return;
	}
	forward(20);
}

// Interrupt service routines are the same as normal
// subroutines (or C funtions) in Cortex-M microcontrollers.
// The following should happen at a rate of 100Hz. 
// The following function is associated with the TIM2 interrupt 
// via the interrupt vector table defined in startup.c
void TIM2_Handler(void) 
{
	TIM2->SR &= ~BIT0; // clear update interrupt flag

	PWM_Counter++;
	// -- Debug -- Keep this code commented out so see if this is what is causing the ISR issues
	timerCount_100us++; // Global time elapsed counter (for tb only)

	// update global timer (for tb only)
	if (timerCount_100us >= 10) {
		timerCount_100us = 0;
		timerCount_ms++;
	}

	if(pwm1>PWM_Counter)
	{
		GPIOA->ODR |= BIT3;
	}
	else
	{
		GPIOA->ODR &= ~BIT3;
	}
	
	if(pwm2>PWM_Counter)
	{
		GPIOA->ODR |= BIT5;
	}
	else
	{
		GPIOA->ODR &= ~BIT5;
	}
	
	if (PWM_Counter > 100) // THe period is 1ms
	{
		PWM_Counter=0;
		GPIOA->ODR |= (BIT3|BIT5);
	}   
}

// Uses SysTick to delay <us> micro-seconds. 




void SendATCommand (char * s)
{
	char buff[40];
	printf("Command: %s", s);
	GPIOA->ODR &= ~(BIT13); // 'set' pin to 0 is 'AT' mode.
	waitms(10);
	eputs2(s);
	egets2(buff, sizeof(buff)-1);
	GPIOA->ODR |= BIT13; // 'set' pin to 1 is normal operation mode.
	waitms(10);
	printf("Response: %s", buff);
}

// A giant switch statement that maps compressed letters to left wheel and right wheel pwms
void setPWM(char letter) {
    switch (letter) {
        case 'A': // forward fast (lower is faster)
			pwm1 = 0; // right forward 0;
			pwm2 = 1; // left forward = 0; (lower is faster)
			GPIOA->ODR |= BIT2; // pin is at 5V
			GPIOA->ODR |= BIT4; // pin is at 5V
            break;
        case 'B': //forward mid
			pwm1 = 30; // right forward 0;
			pwm2 = 31; // left forward = 0;
			GPIOA->ODR |= BIT2; // pin is at 5V
			GPIOA->ODR |= BIT4; // pin is at 5V
            break;
        case 'C': //forward slow
			pwm1 = 60; // right forward 0;
			pwm2 = 61; // left forward = 0;
			GPIOA->ODR |= BIT2; // pin is at 5V
			GPIOA->ODR |= BIT4; // pin is at 5V
            break;
        case 'D': // backwards fast
			pwm1 = 90; // right backwards
			pwm2 = 87; // left backwards (higher is faster)
			GPIOA->ODR &= ~BIT2; // pin is GND
			GPIOA->ODR &= ~BIT4; // pin is GND
            break;
        case 'E': //backwards mid
			pwm1 = 70; // right backwards
			pwm2 = 67; // left backwards
			GPIOA->ODR &= ~BIT2; // pin is GND (right motor)
			GPIOA->ODR &= ~BIT4; // pin is GND (left motor)
            break;	
        case 'F': //backwards slow
			pwm1 = 50; 				// right backwards
			pwm2 = 47; 				// left backwards
			GPIOA->ODR &= ~BIT2; 	// pin is GND
			GPIOA->ODR &= ~BIT4; 	// pin is GND
            break;
        case 'G': // CW turn on the spot fast
			pwm2 = 20; 			 	// left forward (lower is faster)
			GPIOA->ODR |= BIT4;  	// pin is at 5V
			pwm1 = 80; 		 	// right backwards
			GPIOA->ODR &= ~BIT2; 	// pin is GND
            break;
        case 'H': //CW turn on spot mid
			pwm2 = 40; 			 	// left forward (lower is faster)
			GPIOA->ODR |= BIT4;  	// pin is at 5V
			pwm1 = 60; 		 		// right backwards
			GPIOA->ODR &= ~BIT2; 	// pin is GND
            break;
        case 'I': //CCW turn on spot  fast
			pwm2 = 80; 				// left forward (lower is faster)
			GPIOA->ODR &= ~BIT4; 	// pin is at 5V
			pwm1 = 20; 				// right backwards
			GPIOA->ODR |= BIT2; 	// pin is GND
            break;
        case 'J': //CCW turn on sport mid
			pwm2 = 60; 		// left forward (lower is faster)
			GPIOA->ODR &= ~BIT4; // pin is at 5V
			pwm1 = 40; 	// right backwards
			GPIOA->ODR |= BIT2; // pin is GND
            break;			
        case 'K': //diagonal NE 
			pwm2 = 0;			// left forward fast (lower is faster)
			GPIOA->ODR |= BIT4; // pin is at 5V
			pwm1 = 30;          // right forward slow (lower is faster)
			GPIOA->ODR |= BIT2; // pin is at 5V
            break;
        case 'L': //diagonal NW 
			pwm2 = 30; 			 	// left forward slow
			GPIOA->ODR |= BIT4;  	// pin is at 5V
			pwm1 = 0; 		 		// right forward fast
			GPIOA->ODR |= BIT2; 	// pin is 5V
            break;
        case 'M': //diagonal SE
			pwm1 = 70; 			 // right backwards slow
			GPIOA->ODR &= ~BIT2; // pin is at GND
			pwm2 = 100; 		 // left backwards fast
			GPIOA->ODR &= ~BIT4; // pin is at GND
            break;
        case 'N': //diagonal SW
			pwm1 = 100; // right backwards fast
			GPIOA->ODR &= ~BIT2; // pin is at GND
			pwm2 = 70; // left backwards slow
			GPIOA->ODR &= ~BIT4; // pin is at GND
            break;
        case 'Z': // stop car
			pwm1 = 0;
			pwm2 = 0;
			GPIOA->ODR &= ~BIT2; // pin is GND
			GPIOA->ODR &= ~BIT4; // pin is GND
        default:
            break;
    }
}
/* Function: Decodes letters as 
   Params:
	- letter -- encoded letter that is sent over
*/
void pathFindingDecoder (int letter) {
	// Hardcoded switch statement range
	// If input character does not match with anything, then this will exit without calling anything
	switch (letter) {
		case '0': CW_turn(0); forward(10); break;
        case '1': CW_turn(23); forward(10); break;
        case '2': CW_turn(46); forward(10); break;
        case '3': CW_turn(68); forward(10); break;
        case '4': CW_turn(91); forward(10); break;
        case '5': CW_turn(113); forward(10); break; 
        case '6': CW_turn(136); forward(10); break;
        case '7': CW_turn(158); forward(10); break;
        case '8': CCW_turn(179); forward(10); break;
        case '9': CCW_turn(157); forward(10); break;
        case 'O': CCW_turn(134); forward(10); break;
        case 'P': CCW_turn(112); forward(10); break;
        case 'Q': CCW_turn(89); forward(10); break;
        case 'R': CCW_turn(67); forward(10); break;
        case 'S': CCW_turn(44); forward(10); break;
        case 'T': CCW_turn(22); forward(10); break;
        case 'U': CW_turn(0); forward(20); break;
        case 'V': CW_turn(23); forward(20); break;
        case 'W': CW_turn(46); forward(20); break;
        case 'X': CW_turn(68); forward(20); break;
        case 'Y': CW_turn(91); forward(20); break;
        case 'f': CW_turn(113); forward(20); break;
        case 'g': CW_turn(136); forward(20); break;
        case 'h': CW_turn(158); forward(20); break;
        case 'i': CCW_turn(179); forward(20); break;
        case 'j': CCW_turn(157); forward(20); break;
        case 'k': CCW_turn(134); forward(20); break;
        case 'l': CCW_turn(112); forward(20); break;
        case 'n': CCW_turn(89); forward(20); break;
        case 'o': CCW_turn(67); forward(20); break;
        case 'p': CCW_turn(44); forward(20); break;
        case 'q': CCW_turn(22); forward(20); break;
        case 'r': CW_turn(0); forward(30); break;
        case 's': CW_turn(1); forward(30); break;
        case 't': CW_turn(23); forward(30); break;
        case 'u': CW_turn(46); forward(30); break;
        case 'v': CW_turn(68); forward(30); break;
        case 'w': CW_turn(91); forward(30); break;
        case 'x': CW_turn(113); forward(30); break;
        case 'y': CW_turn(136); forward(30); break;
        case '`': CW_turn(158); forward(30); break;
        case '~': CCW_turn(179); forward(30); break;
        case '!': CCW_turn(157); forward(30); break;
        case '@': CCW_turn(134); forward(30); break;
        case '#': CCW_turn(112); forward(30); break;
        case '$': CCW_turn(89); forward(30); break;
        case '%': CCW_turn(67); forward(30); break;
        case '^': CCW_turn(44); forward(30); break;
        case '&': CW_turn(0); forward(45); break;
        case '*': CW_turn(23); forward(45); break;
        case '(': CW_turn(46); forward(45); break;
        case ')': CW_turn(68); forward(45); break;
        case '-': CW_turn(91); forward(45); break;
        case '_': CW_turn(113); forward(45); break;
        case '+': CW_turn(136); forward(45); break;
        case '=': CW_turn(158); forward(45); break;
        case '{': CCW_turn(179); forward(45); break;
        case '}': CCW_turn(157); forward(45); break;
        case '[': CCW_turn(134); forward(45); break;
        case ']': CCW_turn(112); forward(45); break;
        case '|': CCW_turn(89); forward(45); break;
        case '\\': CCW_turn(67); forward(45); break;
        case ';': CCW_turn(44); forward(45); break;
        case ':': CCW_turn(22); forward(45); break;
		default:
			// Handle unknown characters or default case
			break; // This will make it so that the robot doesn't do anything. 
    }
}

void ButtonCommand (char letter){

    switch(letter){
        case '?':
            emergency_stop();
            break;
        case '/':
            square();
            break;
        case '\'':
            circle();
            break;
        case '"':
            figure8();
            break;
        default:
            // Handle the default case if none of the expected characters are matched
            break;
    }   
    return;
}


// LQFP32 pinout
//		           ----------
//		       VDD -|1       32|- VSS
//		      PC14 -|2       31|- BOOT0
//		      PC15 -|3       30|- PB7
//		      NRST -|4       29|- PB6
//		      VDDA -|5       28|- PB5
//		       PA0 -|6       27|- PB4
//		       PA1 -|7       26|- PB3
//  (L Motor)  PA2 -|8       25|- PA15
//  (pwm1)     PA3 -|9       24|- PA14
//	(R Motor)  PA4 -|10      23|- PA13
//	(pwm2)     PA5 -|11      22|- PA12 
//		       PA6 -|12      21|- PA11 
//		       PA7 -|13      20|- PA10 (Reserved for RXD)
//		       PB0 -|14      19|- PA9  (Reserved for TXD)
//		       PB1 -|15      18|- PA8
//		       VSS -|16      17|- VDD
//		             ----------

void Hardware_Init(void)
{
	// Set up output pins
	RCC->IOPENR |= BIT0; // peripheral clock enable for port A
    GPIOA->MODER = (GPIOA->MODER & ~(BIT4|BIT5)) | BIT4; 	// Make pin PA2 output (page 200 of RM0451, two bits used to configure: bit0=1, bit1=0)
	GPIOA->OTYPER &= ~BIT2; // Push-pull
    GPIOA->MODER = (GPIOA->MODER & ~(BIT6|BIT7)) | BIT6; 	// Make pin PA3 output (page 200 of RM0451, two bits used to configure: bit0=1, bit1=0)
	GPIOA->OTYPER &= ~BIT3; // Push-pull
    GPIOA->MODER = (GPIOA->MODER & ~(BIT8|BIT9)) | BIT8; 	// Make pin PA4 output (page 200 of RM0451, two bits used to configure: bit0=1, bit1=0)
	GPIOA->OTYPER &= ~BIT4; // Push-pull
    GPIOA->MODER = (GPIOA->MODER & ~(BIT10|BIT11)) | BIT10; // Make pin PA5 output (page 200 of RM0451, two bits used to configure: bit0=1, bit1=0)
	GPIOA->OTYPER &= ~BIT5; // Push-pull
	GPIOA->MODER = (GPIOA->MODER & ~(BIT14|BIT15)) | BIT14; // Make pin PA6 output (page 200 of RM0451, two bits used to configure: bit0=1, bit1=0)
	GPIOA->OTYPER &= ~BIT7; // Push-pull

	// Set up timer
	RCC->APB1ENR |= BIT0;   // turn on clock for timer2 (UM: page 177)
	TIM2->ARR = F_CPU/DEF_F-1;
	NVIC->ISER[0] |= BIT15; // enable timer 2 interrupts in the NVIC
	TIM2->CR1 |= BIT4;      // Downcounting    
	TIM2->CR1 |= BIT7;      // ARPE enable    
	TIM2->DIER |= BIT0;     // enable update event (reload event) interrupt 
	TIM2->CR1 |= BIT0;      // enable counting    


	__enable_irq();

	//from JDY40
	GPIOA->OSPEEDR=0xffffffff; // All pins of port A configured for very high speed! Page 201 of RM0451

	RCC->IOPENR |= BIT0; // peripheral clock enable for port A

    GPIOA->MODER = (GPIOA->MODER & ~(BIT27|BIT26)) | BIT26; // Make pin PA13 output (page 200 of RM0451, two bits used to configure: bit0=1, bit1=0))
	GPIOA->ODR |= BIT13; // 'set' pin to 1 is normal operation mode.

	GPIOA->MODER &= ~(BIT12 | BIT13); // Make pin PA8 input
	// Activate pull up for pin PA6:
	GPIOA->PUPDR |= BIT12; 
	GPIOA->PUPDR &= ~(BIT13);
	
