maya-taylor/Project2ELEC291/integrated_files/STM32integration.c
}

#define PIN_PERIOD (GPIOA->IDR&BIT6)

// GetPeriod() seems to work fine for frequencies between 300Hz and 600kHz - EDIT THIS FUNC IF FREQ IS OUTSIDE RANGE
// 'n' is used to measure the time of 'n' periods; this increases accuracy.
long int GetPeriod (int n)
{
	__disable_irq();
	int i;
	unsigned int saved_TCNT1a, saved_TCNT1b;
	
	SysTick->LOAD = 0xffffff;  // 24-bit counter set to check for signal present
	SysTick->VAL = 0xffffff; // load the SysTick counter
	SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk; // Enable SysTick IRQ and SysTick Timer */
	while (PIN_PERIOD!=0) // Wait for square wave to be 0
	{
		if(SysTick->CTRL & BIT16) return 0;
	}
	SysTick->CTRL = 0x00; // Disable Systick counter

	SysTick->LOAD = 0xffffff;  // 24-bit counter set to check for signal present
	SysTick->VAL = 0xffffff; // load the SysTick counter
	SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk; // Enable SysTick IRQ and SysTick Timer */
	while (PIN_PERIOD==0) // Wait for square wave to be 1
	{
		if(SysTick->CTRL & BIT16) return 0;
	}
	SysTick->CTRL = 0x00; // Disable Systick counter
	
	SysTick->LOAD = 0xffffff;  // 24-bit counter reset
	SysTick->VAL = 0xffffff; // load the SysTick counter to initial value
	SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk; // Enable SysTick IRQ and SysTick Timer */
	for(i = 0; i < n; i++) // Measure the time of 'n' periods
	{
		while (PIN_PERIOD!=0) // Wait for square wave to be 0
		{
			if(SysTick->CTRL & BIT16) return 0;
		}
		while (PIN_PERIOD==0) // Wait for square wave to be 1
		{
			if(SysTick->CTRL & BIT16) return 0;
		}
	}
	SysTick->CTRL = 0x00; // Disable Systick counter
	__enable_irq();

	return 0xffffff-SysTick->VAL;
}

char MapFrequency(int freq) {
    char letter;

	if (freq > metalLevel_5)
		letter = 'e';
	else if (freq > metalLevel_4)
		letter = 'd';
	else if (freq > metalLevel_3)
		letter = 'c';
	else if (freq > metalLevel_2)
		letter = 'b';
	else if (freq > metalLevel_1)
		letter = 'a';
	else 
		letter  = 'z';

    return letter;
}


int main(void)
{
    char buff[4];
	int robot_state = S_MANUAL; // sets robot control mode to `MANUAL` which is the default. Joystick controlled  
	long int count;
	float T, f;
	char dirc, freqc;
	
	int sum_count = 0; //count to keep track of first 10 vals
	int sum_freq = 0; //sum of first 10 frequencies
	int baseline_freq;
	int pastfreqs[AVG_NUM];
	int avg_sum = 0;
	int avg_freq = 0;
	int i = 0;

    RCC->IOPENR |= 0x00000001; // peripheral clock enable for port A Rohan wants to delete this, already declared in hardware init

	GPIOA->MODER &= ~(BIT12 | BIT13); // Make pin PA6 input
	// Activate pull up for pin PA6:
	GPIOA->PUPDR |= BIT12; 
	GPIOA->PUPDR &= ~(BIT13); 

	Hardware_Init();
	initUART2(9600); //from radio
	
	waitms(500); // Give putty a chance to start before we send characters with printf()
	
	printf("\x1b[2J"); // Clear screen using ANSI escape sequence.
    printf("Metal Detecting Robot\r\n");

	// We should select an unique device ID.  The device ID can be a hex
	// number from 0x0000 to 0xFFFF.  In this case is set to 0xABBA
	SendATCommand("AT+DVIDA0A0\r\n");  

	// To check configuration
	SendATCommand("AT+VER\r\n");
	SendATCommand("AT+BAUD\r\n");
	SendATCommand("AT+RFID\r\n");
	SendATCommand("AT+DVID\r\n");
	SendATCommand("AT+RFC\r\n");
	SendATCommand("AT+POWE\r\n");
	SendATCommand("AT+CLSS\r\n");


	//timerCount_100us = 0; // increments by 1 every 10us (for tb only)
	//timerCount_ms = 0;   // (for tb only)

	//use motorControlLoop(x,y)

	// = = = = = = = = = Testing pathFindingDecoder with a series of characters = = = = = = = 
	// angular velocity test

//	stopCar_ms(1000); // this process is blocking
//	CW_turn(360);
//	stopCar_ms(1000);
//	CCW_turn(360);
//	stopCar_ms(1000);
//	CW_turn(270);
//	stopCar_ms(1000);
//	CCW_turn(270);
//	stopCar_ms(1000);
//	CW_turn(180);
//	stopCar_ms(1000);
//	CCW_turn(180);
//	stopCar_ms(1000);
//	CW_turn(90);
//	stopCar_ms(1000);
//	CCW_turn(90);
//	stopCar_ms(1000);
	//str_line();
	//stopCar_ms(1000); // this process is blocking
	//circle();
	//stopCar_ms(1000); // this process is blocking
	//square();
	//stopCar_ms(1000); // this process is blocking
	//figure8();
	//stopCar_ms(1000); // this process is blocking
	
	// Path Finding test
	// stopCar_ms(2000);
	// int test_char = 'Å'; // forward
	// pathFindingDecoder(test_char);
	// test_char = '§'; // 35cm and turns 90 degrees CCW
	// pathFindingDecoder(test_char);
	// test_char = '§'; // 35cm and turns 90 degrees CCW
	// pathFindingDecoder(test_char);
	// test_char = '§';
	// pathFindingDecoder(test_char);
	// stopCar_ms(3000);

	// = = = = = = = = = Main Loop = = = = = = = 
	while (1) {
		// insert joystick reading 
		  


		if (ReceivedBytes2()>0)
		{
			egets2(buff, sizeof(buff)-1);
			
			//character conversions


			printf("RX: %s", buff);
			//printf("len: %d", strlen(buff));
			if (buff[0]=='m') {// remote wants metal detector status

				count=GetPeriod(100);
				T= 1.0*count/(F_CPU*100.0); // Since we have the time of 200 periods, we need to divide by 200
				f=1.0/T;
				
				waitms(5);
				
				//printf("count = %d, f=%.2f\r\n",count, f);
				
				if (count==0) {
					eputs2("z\r\n");
				}
				else {
					// do freq mapping here!
					if(sum_count < 10)
					{
						sum_freq += f;
						sum_count++;
						freqc = 'z';
						if (sum_count > 10-AVG_NUM) {
							avg_sum += f;
							pastfreqs[i] = f;
							i++;
						}
					}
					if(sum_count == 10)
					{
						baseline_freq = sum_freq/10;
						sum_count++;
						freqc = 'z';						
					}
					if(sum_count > 10)
					{
						//this is where we start sending our baseline
						avg_sum-=pastfreqs[i%AVG_NUM];
						pastfreqs[i%AVG_NUM]=f;
						avg_sum+=f;
						avg_freq=avg_sum/AVG_NUM;
						i++;
						//printf("sum = %d, avg = %d\r\n", avg_sum, avg_freq);
						freqc = MapFrequency((int) (avg_freq-baseline_freq));

					}
					sprintf(buff,"%c\r\n",freqc);
					printf(buff);
					eputs2(buff);
				}
			}
			//changing if statement to receive position instead of M being sent
			else // remote sent pos data
			{
				dirc = buff[0];
				
				if(dirc == '.')
					PathFind_Flag = 1;
				else if(dirc == ',')
					PathFind_Flag = 0;
				
				//Runs joystick commands if pathfinding is off
				if (PathFind_Flag == 0){	
					setPWM(dirc); 		// use character `dirc` to directly set PWM values
					ButtonCommand(dirc);
			    }
				else if (PathFind_Flag == 1){
					pathFindingDecoder(dirc);
				}

				//Checks for toggle variable for pathfinding mode

				
			}
			
		}
	}

}